mountaintom/xx-lv_binding_micropython/driver/esp32/lcd_bus/i80/i80_bus.c

#if (SOC_LCD_I80_SUPPORTED == 1)

#include "i80_bus.h"
#include "bus_common.h"

#include "esp_lcd_panel_io.h"
#include "esp_heap_caps.h"
#include "hal/lcd_types.h"

#include "mphalport.h"
#include "py/obj.h"
#include "py/runtime.h"
#include "py/gc.h"

#include <string.h>


bool i80_bus_trans_done_cb(esp_lcd_panel_io_handle_t panel_io, esp_lcd_panel_io_event_data_t *edata, void *user_ctx)
{
        mp_lcd_i80_bus_obj_t *bus_obj = (mp_lcd_i80_bus_obj_t *)user_ctx;
        if (bus_obj->callback != mp_const_none) {
            mp_sched_schedule(bus_obj->callback, bus_obj->user_ctx);
            mp_hal_wake_main_task_from_isr();
        }

        return false;
}


STATIC void mp_lcd_i80_bus_print(const mp_print_t *print, mp_obj_t self_in, mp_print_kind_t kind)
{
    (void) kind;
    mp_lcd_i80_bus_obj_t *self = MP_OBJ_TO_PTR(self_in);

    if (self->bus_config.bus_width == 8) {
        mp_printf(
            print,
            "<I8080 dc=%u, cs=%u, wr=%u, pclk=%u, dc_low_on_data=%u, dc_as_cmd_phase=%u, cmd_bits=%u, param_bits=%u, dc_idle_level=%u, dc_dummy_level=%u, buffer_size=%u, cs_active_high=%u, reverse_color_bits=%u, swap_color_bytes=%u, pclk_active_neg=%u, pclk_idle_low=%u, pclk_src=%u, data0=%u, data1=%u, data2=%u, data3=%u, data4=%u, data5=%u, data6=%u, data7=%u >",
            self->bus_config.dc_gpio_num,
            self->panel_io_config.cs_gpio_num,
            self->bus_config.wr_gpio_num,
            self->panel_io_config.pclk_hz,
            self->panel_io_config.dc_levels.dc_data_level,
            self->panel_io_config.dc_levels.dc_cmd_level,
            self->panel_io_config.lcd_cmd_bits,
            self->panel_io_config.lcd_param_bits,
            self->panel_io_config.dc_levels.dc_idle_level,
            self->panel_io_config.dc_levels.dc_dummy_level,
            self->bus_config.max_transfer_bytes,
            self->panel_io_config.flags.cs_active_high,
            self->panel_io_config.flags.reverse_color_bits,
            self->panel_io_config.flags.swap_color_bytes,
            self->panel_io_config.flags.pclk_active_neg,
            self->panel_io_config.flags.pclk_idle_low,
            self->bus_config.clk_src,
            self->bus_config.data_gpio_nums[0],
            self->bus_config.data_gpio_nums[1],
            self->bus_config.data_gpio_nums[2],
            self->bus_config.data_gpio_nums[3],
            self->bus_config.data_gpio_nums[4],
            self->bus_config.data_gpio_nums[5],
            self->bus_config.data_gpio_nums[6],
            self->bus_config.data_gpio_nums[7]
        );

    } else if (self->bus_config.bus_width == 9) {
        mp_printf(
            print,
            "<I8080 dc=%u, cs=%u, wr=%u, pclk=%u, dc_low_on_data=%u, dc_as_cmd_phase=%u, cmd_bits=%u, param_bits=%u, dc_idle_level=%u, dc_dummy_level=%u, buffer_size=%u, cs_active_high=%u, reverse_color_bits=%u, swap_color_bytes=%u, pclk_active_neg=%u, pclk_idle_low=%u, pclk_src=%u, data0=%u, data1=%u, data2=%u, data3=%u, data4=%u, data5=%u, data6=%u, data7=%u, data8=%u >",
            self->bus_config.dc_gpio_num,
            self->panel_io_config.cs_gpio_num,
            self->bus_config.wr_gpio_num,
            self->panel_io_config.pclk_hz,
            self->panel_io_config.dc_levels.dc_data_level,
            self->panel_io_config.dc_levels.dc_cmd_level,
            self->panel_io_config.lcd_cmd_bits,
            self->panel_io_config.lcd_param_bits,
            self->panel_io_config.dc_levels.dc_idle_level,
            self->panel_io_config.dc_levels.dc_dummy_level,
            self->bus_config.max_transfer_bytes,
            self->panel_io_config.flags.cs_active_high,
            self->panel_io_config.flags.reverse_color_bits,
            self->panel_io_config.flags.swap_color_bytes,
            self->panel_io_config.flags.pclk_active_neg,
            self->panel_io_config.flags.pclk_idle_low,
            self->bus_config.clk_src,
            self->bus_config.data_gpio_nums[0],
            self->bus_config.data_gpio_nums[1],
            self->bus_config.data_gpio_nums[2],
            self->bus_config.data_gpio_nums[3],
            self->bus_config.data_gpio_nums[4],
            self->bus_config.data_gpio_nums[5],
            self->bus_config.data_gpio_nums[6],
            self->bus_config.data_gpio_nums[7],
            self->bus_config.data_gpio_nums[8]
        );

    } else {
        mp_printf(
            print,
            "<I8080 dc=%u, cs=%u, wr=%u, pclk=%u, dc_low_on_data=%u, dc_as_cmd_phase=%u, cmd_bits=%u, param_bits=%u, dc_idle_level=%u, dc_dummy_level=%u, buffer_size=%u, cs_active_high=%u, reverse_color_bits=%u, swap_color_bytes=%u, pclk_active_neg=%u, pclk_idle_low=%u, pclk_src=%u, data0=%u, data1=%u, data2=%u, data3=%u, data4=%u, data5=%u, data6=%u, data7=%u, data8=%u, data9=%u, data10=%u, data11=%u, data12=%u, data13=%u, data14=%u, data15=%u >",
            self->bus_config.dc_gpio_num,
            self->panel_io_config.cs_gpio_num,
            self->bus_config.wr_gpio_num,
            self->panel_io_config.pclk_hz,
            self->panel_io_config.dc_levels.dc_data_level,
            self->panel_io_config.dc_levels.dc_cmd_level,
            self->panel_io_config.lcd_cmd_bits,
            self->panel_io_config.lcd_param_bits,
            self->panel_io_config.dc_levels.dc_idle_level,
            self->panel_io_config.dc_levels.dc_dummy_level,
            self->bus_config.max_transfer_bytes,
            self->panel_io_config.flags.cs_active_high,
            self->panel_io_config.flags.reverse_color_bits,
            self->panel_io_config.flags.swap_color_bytes,
            self->panel_io_config.flags.pclk_active_neg,
            self->panel_io_config.flags.pclk_idle_low,
            self->bus_config.clk_src,
            self->bus_config.data_gpio_nums[0],
            self->bus_config.data_gpio_nums[1],
            self->bus_config.data_gpio_nums[2],
            self->bus_config.data_gpio_nums[3],
            self->bus_config.data_gpio_nums[4],
            self->bus_config.data_gpio_nums[5],
            self->bus_config.data_gpio_nums[6],
            self->bus_config.data_gpio_nums[7],
            self->bus_config.data_gpio_nums[8],
            self->bus_config.data_gpio_nums[9],
            self->bus_config.data_gpio_nums[10],
            self->bus_config.data_gpio_nums[11],
            self->bus_config.data_gpio_nums[12],
            self->bus_config.data_gpio_nums[13],
            self->bus_config.data_gpio_nums[14],
            self->bus_config.data_gpio_nums[15]
        );
    }
}


STATIC mp_obj_t mp_lcd_i80_bus_make_new(const mp_obj_type_t *type, size_t n_args, size_t n_kw, const mp_obj_t *all_args) {
    enum {
        ARG_dc,
        ARG_wr,
        ARG_cs,
        ARG_data0,
        ARG_data1,
        ARG_data2,
        ARG_data3,
        ARG_data4,
        ARG_data5,
        ARG_data6,
        ARG_data7,
        #if (SOC_LCD_I80_BUS_WIDTH >= 9)
        ARG_data8,
        #endif
        #if (SOC_LCD_I80_BUS_WIDTH >= 10)
        ARG_data9,
        #endif
        #if (SOC_LCD_I80_BUS_WIDTH >= 11)
        ARG_data10,
        #endif
        #if (SOC_LCD_I80_BUS_WIDTH >= 12)
        ARG_data11,
        #endif
        #if (SOC_LCD_I80_BUS_WIDTH >= 13)
        ARG_data12,
        #endif
        #if (SOC_LCD_I80_BUS_WIDTH >= 14)
        ARG_data13,
        #endif
        #if (SOC_LCD_I80_BUS_WIDTH >= 15)
        ARG_data14,
        #endif
        #if (SOC_LCD_I80_BUS_WIDTH >= 16)
        ARG_data15,
        #endif
        ARG_freq,
        ARG_dc_idle_level,
        ARG_dc_cmd_level,
        ARG_dc_dummy_level,
        ARG_dc_data_level,
        ARG_cmd_bits,
        ARG_param_bits,
        ARG_buffer_size,
        ARG_fb_in_psram,
        ARG_use_dma,
        ARG_cs_active_high,
        ARG_reverse_color_bits,
        ARG_swap_color_bytes,
        ARG_pclk_active_neg,
        ARG_pclk_idle_low,
    };

