mountaintom/xx-lv_binding_micropython/driver/esp32/lcd_bus/i80/i80_bus.c
    const mp_arg_t make_new_args[] = {
        { MP_QSTR_dc,                 MP_ARG_INT  | MP_ARG_REQUIRED                        },
        { MP_QSTR_wr,                 MP_ARG_INT  | MP_ARG_REQUIRED                        },
        { MP_QSTR_cs,                 MP_ARG_INT  | MP_ARG_REQUIRED                        },
        { MP_QSTR_data0,              MP_ARG_INT  | MP_ARG_REQUIRED                        },
        { MP_QSTR_data1,              MP_ARG_INT  | MP_ARG_REQUIRED                        },
        { MP_QSTR_data2,              MP_ARG_INT  | MP_ARG_REQUIRED                        },
        { MP_QSTR_data3,              MP_ARG_INT  | MP_ARG_REQUIRED                        },
        { MP_QSTR_data4,              MP_ARG_INT  | MP_ARG_REQUIRED                        },
        { MP_QSTR_data5,              MP_ARG_INT  | MP_ARG_REQUIRED                        },
        { MP_QSTR_data6,              MP_ARG_INT  | MP_ARG_REQUIRED                        },
        { MP_QSTR_data7,              MP_ARG_INT  | MP_ARG_REQUIRED                        },
        #if (SOC_LCD_I80_BUS_WIDTH >= 9)
        { MP_QSTR_data8,              MP_ARG_INT  | MP_ARG_KW_ONLY,  { .u_int = -1       } },
        #endif
        #if (SOC_LCD_I80_BUS_WIDTH >= 10)
        { MP_QSTR_data9,              MP_ARG_INT  | MP_ARG_KW_ONLY,  { .u_int = -1       } },
        #endif
        #if (SOC_LCD_I80_BUS_WIDTH >= 11)
        { MP_QSTR_data10,             MP_ARG_INT  | MP_ARG_KW_ONLY,  { .u_int = -1       } },
        #endif
        #if (SOC_LCD_I80_BUS_WIDTH >= 12)
        { MP_QSTR_data11,             MP_ARG_INT  | MP_ARG_KW_ONLY,  { .u_int = -1       } },
        #endif
        #if (SOC_LCD_I80_BUS_WIDTH >= 13)
        { MP_QSTR_data12,             MP_ARG_INT  | MP_ARG_KW_ONLY,  { .u_int = -1       } },
        #endif
        #if (SOC_LCD_I80_BUS_WIDTH >= 14)
        { MP_QSTR_data13,             MP_ARG_INT  | MP_ARG_KW_ONLY,  { .u_int = -1       } },
        #endif
        #if (SOC_LCD_I80_BUS_WIDTH >= 15)
        { MP_QSTR_data14,             MP_ARG_INT  | MP_ARG_KW_ONLY,  { .u_int = -1       } },
        #endif
        #if (SOC_LCD_I80_BUS_WIDTH >= 16)
        { MP_QSTR_data15,             MP_ARG_INT  | MP_ARG_KW_ONLY,  { .u_int = -1       } },
        #endif
        { MP_QSTR_freq,               MP_ARG_INT  | MP_ARG_KW_ONLY,  { .u_int = 10000000 } },
        { MP_QSTR_dc_idle_level,      MP_ARG_BOOL | MP_ARG_KW_ONLY,  { .u_bool = false   } },
        { MP_QSTR_dc_cmd_level,       MP_ARG_BOOL | MP_ARG_KW_ONLY,  { .u_bool = false   } },
        { MP_QSTR_dc_dummy_level,     MP_ARG_BOOL | MP_ARG_KW_ONLY,  { .u_bool = false   } },
        { MP_QSTR_dc_data_level,      MP_ARG_BOOL | MP_ARG_KW_ONLY,  { .u_bool = false   } },
        { MP_QSTR_cmd_bits,           MP_ARG_INT  | MP_ARG_KW_ONLY,  { .u_int = 8        } },
        { MP_QSTR_param_bits,         MP_ARG_INT  | MP_ARG_KW_ONLY,  { .u_int = 8        } },
        { MP_QSTR_buffer_size,        MP_ARG_INT  | MP_ARG_KW_ONLY,  { .u_int = 0        } },
        { MP_QSTR_fb_in_psram,        MP_ARG_BOOL | MP_ARG_KW_ONLY,  { .u_bool = false   } },
        { MP_QSTR_use_dma,            MP_ARG_BOOL | MP_ARG_KW_ONLY,  { .u_bool = true    } },
        { MP_QSTR_cs_active_high,     MP_ARG_BOOL | MP_ARG_KW_ONLY,  { .u_bool = false   } },
        { MP_QSTR_reverse_color_bits, MP_ARG_BOOL | MP_ARG_KW_ONLY,  { .u_bool = false   } },
        { MP_QSTR_swap_color_bytes,   MP_ARG_BOOL | MP_ARG_KW_ONLY,  { .u_bool = false   } },
        { MP_QSTR_pclk_active_neg,    MP_ARG_BOOL | MP_ARG_KW_ONLY,  { .u_bool = false   } },
        { MP_QSTR_pclk_idle_low,      MP_ARG_BOOL | MP_ARG_KW_ONLY,  { .u_bool = false   } }
    };

    mp_arg_val_t args[MP_ARRAY_SIZE(make_new_args)];
    mp_arg_parse_all_kw_array(
        n_args,
        n_kw,
        all_args,
        MP_ARRAY_SIZE(make_new_args),
        make_new_args,
        args
    );

    // create new object
    mp_lcd_i80_bus_obj_t *self = m_new_obj(mp_lcd_i80_bus_obj_t);
    self->base.type = &mp_lcd_i80_bus_type;


    self->buffer_size = (int) args[ARG_buffer_size].u_int;
    self->fb_in_psram = (bool) args[ARG_fb_in_psram].u_bool;
    self->use_dma = (bool) args[ARG_use_dma].u_bool;

    if (self->buffer_size != -1) {
        uint32_t mem_cap = 0;

        if (self->fb_in_psram) {
            mem_cap |= MALLOC_CAP_SPIRAM;
        } else {
            mem_cap |= MALLOC_CAP_INTERNAL;
        }

        if (self->use_dma) {
            mem_cap |= MALLOC_CAP_DMA;
            self->buf1 = (uint8_t *)heap_caps_malloc((size_t)self->buffer_size, mem_cap);
            self->buf2 = (uint8_t *)heap_caps_malloc((size_t)self->buffer_size, mem_cap);
        } else {
            self->buf1 = (uint8_t *)heap_caps_malloc((size_t)self->buffer_size, mem_cap);
        }

        self->bus_config.max_transfer_bytes = (size_t)self->buffer_size;
    }

    self->callback = mp_const_none;
    self->user_ctx = mp_const_none;

    self->bus_config.dc_gpio_num = (int)args[ARG_dc].u_int;
    self->bus_config.wr_gpio_num = (int)args[ARG_wr].u_int;
    self->bus_config.clk_src = LCD_CLK_SRC_PLL160M;
    self->bus_config.data_gpio_nums[0] = args[ARG_data0].u_int;
    self->bus_config.data_gpio_nums[1] = args[ARG_data1].u_int;
    self->bus_config.data_gpio_nums[2] = args[ARG_data2].u_int;
    self->bus_config.data_gpio_nums[3] = args[ARG_data3].u_int;
    self->bus_config.data_gpio_nums[4] = args[ARG_data4].u_int;
    self->bus_config.data_gpio_nums[5] = args[ARG_data5].u_int;
    self->bus_config.data_gpio_nums[6] = args[ARG_data6].u_int;
    self->bus_config.data_gpio_nums[7] = args[ARG_data7].u_int;
    #if (SOC_LCD_I80_BUS_WIDTH >= 9)
    self->bus_config.data_gpio_nums[8] = args[ARG_data8].u_int;
    #endif
    #if (SOC_LCD_I80_BUS_WIDTH >= 10)
    self->bus_config.data_gpio_nums[9] = args[ARG_data9].u_int;
    #endif
    #if (SOC_LCD_I80_BUS_WIDTH >= 11)
    self->bus_config.data_gpio_nums[10] = args[ARG_data10].u_int;
    #endif
    #if (SOC_LCD_I80_BUS_WIDTH >= 12)
    self->bus_config.data_gpio_nums[11] = args[ARG_data11].u_int;
    #endif
    #if (SOC_LCD_I80_BUS_WIDTH >= 13)
    self->bus_config.data_gpio_nums[12] = args[ARG_data12].u_int;
    #endif
    #if (SOC_LCD_I80_BUS_WIDTH >= 14)
    self->bus_config.data_gpio_nums[13] = args[ARG_data13].u_int;
    #endif
    #if (SOC_LCD_I80_BUS_WIDTH >= 15)
    self->bus_config.data_gpio_nums[14] = args[ARG_data14].u_int;
    #endif
    #if (SOC_LCD_I80_BUS_WIDTH >= 16)
    self->bus_config.data_gpio_nums[15] = args[ARG_data15].u_int;
    #endif

    uint8_t i = 0;
    for (; i < SOC_LCD_I80_BUS_WIDTH; i++) {
        if (self->bus_config.data_gpio_nums[i] == -1) {
            i -= 1;
            break;
        }
    }

