mountaintom/xx-lv_binding_micropython/driver/esp32/lcd_bus/i80/i80_bus.c
STATIC MP_DEFINE_CONST_FUN_OBJ_KW(mp_lcd_i80_bus_tx_color_obj, 3, mp_lcd_i80_bus_tx_color);


STATIC mp_obj_t mp_lcd_i80_bus_rx_param(size_t n_args, const mp_obj_t *pos_args, mp_map_t *kw_args) {
    enum { ARG_self, ARG_cmd, ARG_data };
    static const mp_arg_t allowed_args[] = {
        { MP_QSTR_self,         MP_ARG_OBJ | MP_ARG_REQUIRED  },
        { MP_QSTR_cmd,   MP_ARG_INT | MP_ARG_REQUIRED  },
        { MP_QSTR_data,  MP_ARG_OBJ | MP_ARG_REQUIRED  },
    };
    mp_arg_val_t args[MP_ARRAY_SIZE(allowed_args)];
    mp_arg_parse_all(n_args, pos_args, kw_args, MP_ARRAY_SIZE(allowed_args), allowed_args, args);

    mp_lcd_i80_bus_obj_t *self = (mp_lcd_i80_bus_obj_t *)args[ARG_self].u_obj;
    int cmd = args[ARG_cmd].u_int;

    mp_buffer_info_t bufinfo;
    mp_get_buffer_raise(args[ARG_data].u_obj, &bufinfo, MP_BUFFER_WRITE);
    esp_err_t ret = esp_lcd_panel_io_rx_param(self->panel_io_handle, cmd, bufinfo.buf, bufinfo.len);

    if (ret != 0) {
        mp_raise_msg_varg(&mp_type_OSError, "%d(esp_lcd_panel_io_rx_param)", ret);
    }
    return mp_const_none;
}

STATIC MP_DEFINE_CONST_FUN_OBJ_KW(mp_lcd_i80_bus_rx_param_obj, 3, mp_lcd_i80_bus_rx_param);


STATIC mp_obj_t mp_lcd_i80_bus_get_frame_buffer(size_t n_args, const mp_obj_t *pos_args, mp_map_t *kw_args) {
    enum { ARG_self, ARG_buffer_number };
    static const mp_arg_t allowed_args[] = {
        { MP_QSTR_self,         MP_ARG_OBJ | MP_ARG_REQUIRED  },
        { MP_QSTR_buffer_number,   MP_ARG_INT | MP_ARG_REQUIRED  }
    };
    mp_arg_val_t args[MP_ARRAY_SIZE(allowed_args)];
    mp_arg_parse_all(n_args, pos_args, kw_args, MP_ARRAY_SIZE(allowed_args), allowed_args, args);

    mp_lcd_i80_bus_obj_t *self = (mp_lcd_i80_bus_obj_t *)args[ARG_self].u_obj;
    int buf_num = args[ARG_buffer_number].u_int;

    if (buf_num == 1) {
        return (mp_obj_t *)self->buf1;
    }

    return (mp_obj_t *)self->buf2;
}

STATIC MP_DEFINE_CONST_FUN_OBJ_KW(mp_lcd_i80_bus_get_frame_buffer_obj, 2, mp_lcd_i80_bus_get_frame_buffer);


STATIC const mp_rom_map_elem_t mp_lcd_i80_bus_locals_dict_table[] = {
    { MP_ROM_QSTR(MP_QSTR_get_frame_buffer),  MP_ROM_PTR(&mp_lcd_i80_bus_get_frame_buffer_obj)  },
    { MP_ROM_QSTR(MP_QSTR_register_callback), MP_ROM_PTR(&mp_lcd_i80_bus_register_callback_obj) },
    { MP_ROM_QSTR(MP_QSTR_tx_param),          MP_ROM_PTR(&mp_lcd_i80_bus_tx_param_obj)          },
    { MP_ROM_QSTR(MP_QSTR_tx_color),          MP_ROM_PTR(&mp_lcd_i80_bus_tx_color_obj)          },
    { MP_ROM_QSTR(MP_QSTR_tx_param),          MP_ROM_PTR(&mp_lcd_i80_bus_rx_param_obj)          },
    { MP_ROM_QSTR(MP_QSTR_init),              MP_ROM_PTR(&mp_lcd_i80_bus_init_obj)              },
    { MP_ROM_QSTR(MP_QSTR_deinit),            MP_ROM_PTR(&mp_lcd_i80_bus_deinit_obj)            },
    { MP_ROM_QSTR(MP_QSTR___del__),           MP_ROM_PTR(&mp_lcd_i80_bus_deinit_obj)            },
    { MP_ROM_QSTR(MP_QSTR_HIGH),              MP_ROM_TRUE                                       },
    { MP_ROM_QSTR(MP_QSTR_LOW),               MP_ROM_FALSE                                      },
};

STATIC MP_DEFINE_CONST_DICT(mp_lcd_i80_bus_locals_dict, mp_lcd_i80_bus_locals_dict_table);


STATIC inline void mp_lcd_i80_bus_p_rx_param(mp_obj_base_t *self_in, int lcd_cmd, void *param, size_t param_size) {
    mp_lcd_i80_bus_obj_t *self = (mp_lcd_i80_bus_obj_t *)self_in;

    esp_err_t ret = esp_lcd_panel_io_rx_param(self->panel_io_handle, lcd_cmd, param, param_size);
    if (ret != 0) {
        mp_raise_msg_varg(&mp_type_OSError, "%d(esp_lcd_panel_io_rx_param)", ret);
    }
}


STATIC inline void mp_lcd_i80_bus_p_tx_param(mp_obj_base_t *self_in, int lcd_cmd, void *param, size_t param_size) {
    mp_lcd_i80_bus_obj_t *self = (mp_lcd_i80_bus_obj_t *)self_in;

    esp_err_t ret = esp_lcd_panel_io_tx_param(self->panel_io_handle, lcd_cmd, param, param_size);
    if (ret != 0) {
        mp_raise_msg_varg(&mp_type_OSError, "%d(esp_lcd_panel_io_tx_param)", ret);
    }
}


STATIC inline void mp_lcd_i80_bus_p_tx_color(mp_obj_base_t *self_in, int lcd_cmd, void *color, size_t color_size) {
    mp_lcd_i80_bus_obj_t *self = (mp_lcd_i80_bus_obj_t *)self_in;

    esp_err_t ret = esp_lcd_panel_io_tx_color(self->panel_io_handle, lcd_cmd, color, color_size);
    if (ret != 0) {
        mp_raise_msg_varg(&mp_type_OSError, "%d(esp_lcd_panel_io_tx_color)", ret);
    }
}


STATIC inline void mp_lcd_i80_bus_p_deinit(mp_obj_base_t *self_in) {
    mp_lcd_i80_bus_obj_t *self = (mp_lcd_i80_bus_obj_t *)self_in;

    esp_err_t ret = esp_lcd_panel_io_del(self->panel_io_handle);
    if (ret != 0) {
        mp_raise_msg_varg(&mp_type_OSError, "%d(esp_lcd_panel_io_del)", ret);
    }

    ret = esp_lcd_del_i80_bus(self->bus_handle);
    if (ret != 0) {
        mp_raise_msg_varg(&mp_type_OSError, "%d(esp_lcd_del_i80_bus)", ret);
    }

    heap_caps_free(self->buf1);
    heap_caps_free(self->buf2);
}


STATIC const mp_lcd_bus_p_t mp_lcd_bus_p = {
    .rx_param = mp_lcd_i80_bus_p_rx_param,
    .tx_param = mp_lcd_i80_bus_p_tx_param,
    .tx_color = mp_lcd_i80_bus_p_tx_color,
    .deinit = mp_lcd_i80_bus_p_deinit
};

#ifdef MP_OBJ_TYPE_GET_SLOT
MP_DEFINE_CONST_OBJ_TYPE(
    mp_lcd_i80_bus_type,
    MP_QSTR_I8080Bus,
    MP_TYPE_FLAG_NONE,
    print, mp_lcd_i80_bus_print,
    make_new, mp_lcd_i80_bus_make_new,
    protocol, &mp_lcd_bus_p,
    locals_dict, (mp_obj_dict_t *)&mp_lcd_i80_bus_locals_dict
);
#else
const mp_obj_type_t mp_lcd_i80_bus_type = {
    { &mp_type_type },
    .name = MP_QSTR_I8080Bus,
    .print = mp_lcd_i80_bus_print,
    .make_new = mp_lcd_i80_bus_make_new,
    .protocol = &mp_lcd_bus_p,
    .locals_dict = (mp_obj_dict_t *)&mp_lcd_i80_bus_locals_dict,
};
#endif

#endif /*(SOC_LCD_I80_SUPPORTED == 1)*/